   ## Welcome Fellow Wanderer  
   - This is the intro to the  
   - Pandas Basics

### First and formost Pandas is a special package wihtin the vast realm of python libraries, it's one of the essintials if your plans incorporate Data Manipulation. 

##### With that  being said lets learn a few things about it.

In [1]:
# To import pandas we type - 'import pandas as pd' (don't use the '' and you can name it anything but pd is recommended)
# Pandas works superfast with numpy arrays thats why its also recommended to know some basics of numpy beforehand

import numpy as np 
import pandas as pd

### Series

##### A series is a one-dimensional array-like object containing a sequence of values(of similar types (like numpy)) of the same type and an associated array of data labels called index.

In [2]:
# The Simplest Series is formed from only an array of Data.
obj = pd.Series([2,4,1,3,5,7,8]) # Keep in mind that python is case sensitive so use -- > 'pd.Series'
print(obj)

0    2
1    4
2    1
3    3
4    5
5    7
6    8
dtype: int64

In [3]:
# now the previous one looks ugly we can alos do this to make it look interesting
IPL_Teams = ['KKR','CSK','RCB','KXIP','MI']
# Because there are 5 teams we need an array that has 5 values
Scores = np.arange(5) # builds an array having values array([0 1 2 3 4 ])
# Lets now make it a bit more interesting
Data_Series = pd.Series(Scores, index = IPL_Teams)
print(Data_Series)
print(" ")
# Now this looks a bit unpolished, lets add some mopre detailing to it
Data_Series.name ='Scores'
Data_Series.index.name = 'Teams'

print(Data_Series.head(3)) # We can also use the head() function to start from the beginning and alos add a limiter in this case its 3
# in the end you could see that because its a series, so the only column stands for Scores

KKR     0
CSK     1
RCB     2
KXIP    3
MI      4
dtype: int64

Teams
KKR    0
CSK    1
RCB    2
Name: Scores, dtype: int64

In [4]:
# Miscsellaneous
arr = pd.Series([-1, 5, -3, 6, 2])
print(arr.index) # this prints out some details of the Series

RangeIndex(start=0, stop=5, step=1)

####   Series Manipulation

In [5]:
unique_name = 'o'
list_u = sorted([5,2,6,3,4,1,8,7,0]) # putting some random values that we will add to the index_builder

index_builder = [unique_name+str(x) for x in list_u] 
# see this is quite interesting we are takinf the values from list_u one by one and then adding it to the unique_name (generator object)

obj1 = pd.Series(list_u, index = index_builder)
print(obj1)

o0    0
o1    1
o2    2
o3    3
o4    4
o5    5
o6    6
o7    7
o8    8
dtype: int64

In [6]:
type(obj1['o4']) # this is a numpy.int64 type file
# now pandas sort of works like a dictionary, see below
print(obj1['o1']) # if you execute only obj1['ossi_1'] without the print statement it will return a numpy.int64 thing 
# you will get the relevant value

1

#### Similarity in Dictionary ( Hash - Tables )

In [7]:
# Just for example
new_dict = dict()
new_dict['Gogol'] = 0
new_dict['Guddu'] = 0
penalty_scores = [1,1,1,1,0,1,1,0,1,0,0,0,1,1,0,1]
# print(len(penalty_scores))
for i in range(0,len(penalty_scores)-1,2):
    new_dict['Gogol'] += penalty_scores[i]
    new_dict['Guddu'] += penalty_scores[i+1]

# print(new_dict)

#similar to the pandas method

new_dict['Guddu'] # this returns the relevant value, like what we saw in pd.Series

5

In [8]:
# Another interesting thing is -->
obj1[['o1','o3','o5']] 
# This returns the values in a table format only the ones you put within the brackeets, not putting the bracketts will throw an error
# because check this out

print("")
print(type(obj1[['o1','o3','o5']]))  # remove the type to get the values
# <class 'pandas.core.series.Series'>

# print(type(obj1['o4','o6'])) # don't run
# 'key of type tuple not found and not a MultiIndex' this is the problem, the pandas thinks that its an single object but we gave it multiplew so it could not process properly

<class 'pandas.core.series.Series'>

In [9]:
obj1[obj1>3] # This will output the details of the objects whose values are more than 3 (in a tabular Structure)

o4    4
o5    5
o6    6
o7    7
o8    8
dtype: int64

In [10]:
# now we will apply the exponential function on the pandas series to see what we get
print(np.exp(obj1)) # Still we get the key pair values in a tabular structure (more like a dict)

o0       1.000000
o1       2.718282
o2       7.389056
o3      20.085537
o4      54.598150
o5     148.413159
o6     403.428793
o7    1096.633158
o8    2980.957987
dtype: float64

In [11]:
# we can also search for particular keys to get their corresponding values
print('o6' in obj1) # as the item is present in the form of a key in the obj1 this will return True

True

In [12]:
# Lets say we have a dictionary that looks like this
Pool_Records = {'Richard': 5,
                'Solemon': 7,
                'Richardo': 15} 
# Assuming the keys are the names of the clients and the numbers represent the total number logins they have performed
# We can easily transfor the dictionary to a pandas series, for that we have to do: 
pandas_series = pd.Series(data = Pool_Records) 
print(pandas_series)
# we could convert this pandas series back to the dictionary by using the .to_dict() function

new_dict = pandas_series.to_dict()
print(type(new_dict)) # Now this acts as a dictionary

Richard      5
Solemon      7
Richardo    15
dtype: int64
<class 'dict'>

In [13]:
import random
players = ['Rohit', 'Gill', 'Virat', 'KL Rahul', 'Hardik', 'Jadeja', 'Surya', 'Panti', 'Shami', 'Bumrah', 'Kuldeep'] # name of some players
Scores_Dict = {player: random.randint(0,200) for player in players}
# print(Scores_Dict)
# Assigning to 0 values
Scores_Dict['Raidu'] = 0 
Scores_Dict['Rahane'] = 0

series_1 = pd.Series(data = Scores_Dict)
print(series_1.head(8))

Rohit       162
Gill        184
Virat       185
KL Rahul     13
Hardik      120
Jadeja      183
Surya       123
Panti       186
dtype: int64

#### Thing is with methods such as .isna , .notna etc you need not to write print all the time

In [14]:
pd.isna(series_1) # This Checks whether the corresponding value is 0 or not
pd.notna(series_1) # Does quite the opposite of the previous one
# you could also do this instead
series_1.isna() # Litrerally does the same thing as the first one

Rohit       False
Gill        False
Virat       False
KL Rahul    False
Hardik      False
Jadeja      False
Surya       False
Panti       False
Shami       False
Bumrah      False
Kuldeep     False
Raidu       False
Rahane      False
dtype: bool

In [15]:
# Just a random Dictionary

lang = {'Las Vegas':'*****',
        'Boston':'****',
        'New York':'***',
        'Torronto':'*',
        'New Orleans':'***'}
for key, values in lang.items():
    print(f'City: {key} Rating: {values}\n')

# now we create another series obj on the converted version of this dict

series2 = pd.Series(lang)
cities = ['Las Vegas','Torronto','New Jersey','California','New York','Boston']
series3 = pd.Series(lang, index = cities)
print(series3) # This will keep the previous values but the new keys that we had put as index will be empty

City: Las Vegas Rating: *****

City: Boston Rating: ****

City: New York Rating: ***

City: Torronto Rating: *

City: New Orleans Rating: ***

Las Vegas     *****
Torronto          *
New Jersey      NaN
California      NaN
New York        ***
Boston         ****
dtype: object

### DataFrame

##### DataFrame represents a rectangular table of data and contains an ordered, named collection of columns,each of which can be a different value type(numeric, string, boolean).

##### The DataFrame has both a row and column index; it can be thought of as a dictionary of Series all sharing the same index

In [16]:
# This is what a typical tabular data structure looks like which is ready for transformation into a pandas DataFrame
data = {'state':['California','Massachuttes','Washington','New York','New Orleans','Nevada'],
        'year': [2001,2001,2003,2003,2002,2004],
        'population': [130000,140000,90000,250000,80000,56000]}

df = pd.DataFrame(data = data)
df.head(6) # will only show the first 6 records

          state  year  population
0    California  2001      130000
1  Massachuttes  2001      140000
2    Washington  2003       90000
3      New York  2003      250000
4   New Orleans  2002       80000
5        Nevada  2004       56000

In [17]:
df.tail() # will show the last 5 records

          state  year  population
1  Massachuttes  2001      140000
2    Washington  2003       90000
3      New York  2003      250000
4   New Orleans  2002       80000
5        Nevada  2004       56000

In [18]:
# You can also rename the columns
df = df.rename(columns = {'state' : 'States','year' : 'Year', 'population' : 'Population'})
df.head() # usually returns the top 5 rows in this case the name of the rows have been changed

         States  Year  Population
0    California  2001      130000
1  Massachuttes  2001      140000
2    Washington  2003       90000
3      New York  2003      250000
4   New Orleans  2002       80000

In [19]:
# You can also extract out the values in specific columns
print(df['States']) # Because we will need 2 out puts therefore before the last one we will have to use the print statement
print("\n")
df['Population']

0      California
1    Massachuttes
2      Washington
3        New York
4     New Orleans
5          Nevada
Name: States, dtype: object

0    130000
1    140000
2     90000
3    250000
4     80000
5     56000
Name: Population, dtype: int64

In [20]:
print(type(df.Population)) # Just this is a series, combined with all of the others, it forms a True DataFrame
df.Population

<class 'pandas.core.series.Series'>

0    130000
1    140000
2     90000
3    250000
4     80000
5     56000
Name: Population, dtype: int64

In [21]:
# now lets say your data has 3 columns but you wanted to add a new column, how wiil you do that and what will be stored in there?
import random
data = {'States':['California','Massachuttes','Washington','New York','New Orleans','Nevada'],
        'Year': [2001,2001,2003,2003,2002,2004],
        'Population': [130000,140000,90000,250000,80000,56000]}
frame = pd.DataFrame(data = data, columns = ['States','Year','Population','Aqi','Crimes'])

# This will drop thew empty columns
# frame = frame.drop(columns = ['Aqi','Crimes'])

# in case you mistakenly added the extra columns , here is away to change their datatypes

frame['Aqi'] = pd.to_numeric(frame['Aqi'],errors = 'coerce')
frame['Crimes'] = pd.to_numeric(frame['Crimes'],errors = 'coerce')

# now we can fill in the Nans
frame['Aqi'] = np.random.randint(50,600,size = len(frame))
frame['Crimes'] = np.random.randint(10,50,size = len(frame))

print(frame)

         States  Year  Population  Aqi  Crimes
0    California  2001      130000  460      33
1  Massachuttes  2001      140000  504      24
2    Washington  2003       90000  452      29
3      New York  2003      250000  549      15
4   New Orleans  2002       80000   59      18
5        Nevada  2004       56000  549      18

In [22]:
# Lets talk about the del keyword, which will delete columns like with a dictionary. e.g - 

frame['Eastern'] = frame['Aqi'] > 200
print(frame) # Will output an extra column, Eastern as its Header with Boolean values as its values

del frame['Eastern']
print("")
print(frame) # we have now deleted the extra boolean column

         States  Year  Population  Aqi  Crimes  Eastern
0    California  2001      130000  460      33     True
1  Massachuttes  2001      140000  504      24     True
2    Washington  2003       90000  452      29     True
3      New York  2003      250000  549      15     True
4   New Orleans  2002       80000   59      18    False
5        Nevada  2004       56000  549      18     True

         States  Year  Population  Aqi  Crimes
0    California  2001      130000  460      33
1  Massachuttes  2001      140000  504      24
2    Washington  2003       90000  452      29
3      New York  2003      250000  549      15
4   New Orleans  2002       80000   59      18
5        Nevada  2004       56000  549      18

In [23]:
# Here is a way to create a dataframe with some data taht you may find interesting
data = pd.DataFrame(np.arange(16).reshape(8,2), index = ['Ohio','Cincinati','New York','California','Kolkata','Delhi','Boston','Toronto'],columns = ['one','two'])
data # in the reshape the first one stands for the numbner of rows and the second one stands for the number of columns

            one  two
Ohio          0    1
Cincinati     2    3
New York      4    5
California    6    7
Kolkata       8    9
Delhi        10   11
Boston       12   13
Toronto      14   15

In [24]:
new_data = data.drop(['Boston','Ohio'])
deta = new_data.drop(columns = ['two'])
deta

            one
Cincinati     2
New York      4
California    6
Kolkata       8
Delhi        10
Toronto      14

### Indexing , Selection, Filtering

In [25]:
# Follow Along the results
obj = pd.Series(np.arange(4.),index = ['a','b','c','d'])
print(obj['b'],'\n') # this returns only b's value
print(obj[1],'\n') # will return the same thing

# now let us do some slicing
print(obj[2:4],'\n') # will returned a sliced Series starting from c and ending at d as you could have already guessed
# now if you want to return the mentioned columns
print(obj[['a','b','c']],'\n')
# you could do the same by replacing [['a','b','c']] with [[0,3]] - this woulda done the same thing
# interestingly we can also put a condition on the returnable output, like this

print(obj[obj<2]) #  this scans through the values from the series and returns the ones that meet the condition

1.0

1.0

c    2.0
d    3.0
dtype: float64

a    0.0
b    1.0
c    2.0
dtype: float64

a    0.0
b    1.0
dtype: float64

C:\Users\GOGOL\AppData\Local\Temp\ipykernel_11876\1566361573.py:4: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(obj[1],'\n') # will return the same thing

### loc and iloc

In [26]:
# let us create a fresh series
obj1 = pd.Series([1,2,3], index = [2,0,1])
obj2 = pd.Series([1,2,3], index = ['a','b','c'])
# when using loc, the expression obj.loc[[0,1,2]] will fail when the index does not contain integers 
# like obj2.loc[[0,1]] - because with this one the index were a/b/c so 
# lets try with obj1
print(obj1.loc[[0,2]]) # this returned the corresponding indexed values
# similarly
print(obj2.loc[['a','c']]) # here we have specified the column names so, we get the corresponding values

0    2
2    1
dtype: int64
a    1
c    3
dtype: int64

In [27]:
# now iloc is quite catchy because with its help even if the index doesn't contain integer values,
# you'll still be able to return them as needed with ints

print(obj2.iloc[[0,1]]) # see we got the a and b

a    1
b    2
dtype: int64

In [28]:
# We can Also Slice with labels, however it works a bit differently from normal python slicing,
# (the endpoint of the slicing is actually included in the results which is usually not the case in python)

print(obj2.loc['a':'c']) # this returns everything

a    1
b    2
c    3
dtype: int64

In [29]:
# lets do some real examples
Games = ['TW3WH','MGSVPP','TFFXIV','FH5','RoadRash']
copies_sold = np.random.randint(100000,5000000, size=len(Games))

frame = pd.DataFrame(data = [copies_sold],
                     index = ['Copies Sold'],
                     columns = [items for items in Games])

print(frame)

# Understand this creation

              TW3WH  MGSVPP   TFFXIV      FH5  RoadRash
Copies Sold  535245  654550  1154103  4882177    989656

In [30]:
# Next DataFrame

data = pd.DataFrame(np.arange(25).reshape((5,5)),
index = ['Kol','Del','Hyd','Ban','Koc'],
columns = ['one','two','three','four','five'])

print(data,'\n') # Full Dataframe formation
print(data['three'],'\n') # this only slices the column 'three'

     one  two  three  four  five
Kol    0    1      2     3     4
Del    5    6      7     8     9
Hyd   10   11     12    13    14
Ban   15   16     17    18    19
Koc   20   21     22    23    24

Kol     2
Del     7
Hyd    12
Ban    17
Koc    22
Name: three, dtype: int64

In [31]:
# lets play around with the dataframe a bit,
print(data[['one','four']],'\n')
print(data[data<14],'\n') # the values that have not met the condition, they will be replaced with NaN
# interestingly if you just print(data>5) - this will return the dataframe with booleans that meet the condition and otherwise
print(data>6) # Good, Right?
# now lets say you want all the values to be greater than 10,
data[data < 10] = np.random.randint(11,100) # this changes all those values to what ever this random function generates
print("")
print(data) # because numpy is a vector type meaning all the operation are going to happen at once,

     one  four
Kol    0     3
Del    5     8
Hyd   10    13
Ban   15    18
Koc   20    23

      one   two  three  four  five
Kol   0.0   1.0    2.0   3.0   4.0
Del   5.0   6.0    7.0   8.0   9.0
Hyd  10.0  11.0   12.0  13.0   NaN
Ban   NaN   NaN    NaN   NaN   NaN
Koc   NaN   NaN    NaN   NaN   NaN

       one    two  three   four   five
Kol  False  False  False  False  False
Del  False  False   True   True   True
Hyd   True   True   True   True   True
Ban   True   True   True   True   True
Koc   True   True   True   True   True

     one  two  three  four  five
Kol   69   69     69    69    69
Del   69   69     69    69    69
Hyd   10   11     12    13    14
Ban   15   16     17    18    19
Koc   20   21     22    23    24

In [32]:
# lets say we want to return a particular details of a row
print(data.loc['Kol'])
# we can also do this with the column
print(data['one']) # however becuase normally loc is required to manipulate indexes, we need not use the loc function

one      69
two      69
three    69
four     69
five     69
Name: Kol, dtype: int64
Kol    69
Del    69
Hyd    10
Ban    15
Koc    20
Name: one, dtype: int64

In [33]:
# lets try to get some values from different cities
print(data.loc[['Del','Ban','Kol']])

     one  two  three  four  five
Del   69   69     69    69    69
Ban   15   16     17    18    19
Kol   69   69     69    69    69

In [34]:
# Lets say we need to combine bith row and column selection in loc by seperating the selections with a comma,
# this is how we'll do it
data.loc['Kol',['two','four']] # take a closer look, the name of the frame is kol, meaning the two and four data columns are of city kol

two     69
four    69
Name: Kol, dtype: int64

In [35]:
# lets asssume we needcity Koc's details, we do know that its in the 4th index so
print(data.iloc[4]) # this returns all the relevant values stored for city koch in the dataframe

one      20
two      21
three    22
four     23
five     24
Name: Koc, dtype: int64

In [36]:
# similarly how about we put two values in the bracketts?
print(data.iloc[[3,1]]) # we used iloc because indexs are not int64
# this returns the co-resspomding values of these two cities which were in the 3rd and 1st index

     one  two  three  four  five
Ban   15   16     17    18    19
Del   69   69     69    69    69

In [37]:
# lets say we have to Slice the indexes with the help of iloc staring from the beginning to the end
print(data.iloc[:,4],'\n') 
# see this returns the last column of all the cities, the name says five
# now if you wanted to return everything
print(data.iloc[:,:])

Kol    69
Del    69
Hyd    14
Ban    19
Koc    24
Name: five, dtype: int64

     one  two  three  four  five
Kol   69   69     69    69    69
Del   69   69     69    69    69
Hyd   10   11     12    13    14
Ban   15   16     17    18    19
Koc   20   21     22    23    24

In [38]:
# now lets say on top of filtering these values, you want to put a condition
# here is how you will do it
data.iloc[:,:][ data.one < 30]
# this returned the matching records the .iloc[:,:] - this is all 
# and the data.one meaning the cities which had their one column values higher than 10

     one  two  three  four  five
Hyd   10   11     12    13    14
Ban   15   16     17    18    19
Koc   20   21     22    23    24

In [39]:
# lets say you use the someseries[-1], what will happen?

# A_Series = pd.Series(np.arange(24))
# print(A_Series)
# try:
#     print(A_Series[-1])
# except IndexError as e:
#     print(f'This is the issue {e}')
# throws an error because pandas Series dont work like tuples or lists

In [40]:
ser2 = pd.Series(np.arange(3.), index = ['a','b','c'])
print(ser2,'\n')
print(ser2[-2])
# this will return b's value because its in the second position
print(ser2[:2])

a    0.0
b    1.0
c    2.0
dtype: float64

1.0
a    0.0
b    1.0
dtype: float64

C:\Users\GOGOL\AppData\Local\Temp\ipykernel_11876\1805340392.py:3: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(ser2[-2])

In [41]:
# lets say we need to replace all the values of a column
data.loc[:,"one"] = 1 # this will replace all the values of the one column for a,b,c
print(data)

     one  two  three  four  five
Kol    1   69     69    69    69
Del    1   69     69    69    69
Hyd    1   11     12    13    14
Ban    1   16     17    18    19
Koc    1   21     22    23    24

In [42]:
# if you wanted to replace with condition, this is what you will have to do
data.loc[data['three'] > 15] = 3
print(data)
# the affected cells are the ones which had values higher than 15

     one  two  three  four  five
Kol    3    3      3     3     3
Del    3    3      3     3     3
Hyd    1   11     12    13    14
Ban    3    3      3     3     3
Koc    3    3      3     3     3

### Arithmetic and Data Alignment

In [43]:
s1 = pd.Series([7.3,-2.5,3.4,1.5], index = ['a','c','d','e'])
s2 = pd.Series([-2.1,2.0,3.6,4.0,3.1], index = ['a','c','e','f','g'])

print(s1,'\n')
print(s2,'\n')

print(s1+s2,'\n') # the rows that don't match between these two series won't connect and will return NaN inplace

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

a   -2.1
c    2.0
e    3.6
f    4.0
g    3.1
dtype: float64

a    5.2
c   -0.5
d    NaN
e    5.1
f    NaN
g    NaN
dtype: float64

In [44]:
# This will follow onto the DataFrames similarly, so I won't be showing that or you know what maybe I will
df1 = pd.DataFrame(np.arange(9).reshape(3,3),index = ['a','c','e'], columns = ['omega','alpha','beta'])
df2 = pd.DataFrame(np.arange(9).reshape(3,3), index = ['b','d','f'], columns = ['omega','alpha','beta'])

print(df1+df2,'\n') # as you could have already guesses, yes because there were no matching rows everything will be null

   omega  alpha  beta
a    NaN    NaN   NaN
b    NaN    NaN   NaN
c    NaN    NaN   NaN
d    NaN    NaN   NaN
e    NaN    NaN   NaN
f    NaN    NaN   NaN

In [45]:
# however, there is a way to prevent this from happening and actually replacing the missing values with 0
# lets try it
print(df1.add(df2,fill_value = 0)) # see the magic, the non-present values were replaced by 0

   omega  alpha  beta
a    0.0    1.0   2.0
b    0.0    1.0   2.0
c    3.0    4.0   5.0
d    3.0    4.0   5.0
e    6.0    7.0   8.0
f    6.0    7.0   8.0

In [46]:
# lets now see how the pandas dataframe handles infinity values, for that we can do this
print(1/df1.add(df2,fill_value = 0)) # as we can see, the infinities are represented as inf
# and remember Pandas is a vectorized thing, so all the operations are operated on all of them at once if not specified

      omega     alpha   beta
a       inf  1.000000  0.500
b       inf  1.000000  0.500
c  0.333333  0.250000  0.200
d  0.333333  0.250000  0.200
e  0.166667  0.142857  0.125
f  0.166667  0.142857  0.125

In [47]:
# let me show you a sort of interesting thing, say
array = np.arange(16.).reshape(4,4)
print(array - array[0]) # so much symmetry, right?

[[ 0.  0.  0.  0.]
 [ 4.  4.  4.  4.]
 [ 8.  8.  8.  8.]
 [12. 12. 12. 12.]]

### Functions and Mapping

In [48]:
frame = pd.DataFrame(np.random.standard_normal((4,4)), columns = list('abcd'), index = ['Kolkata','Mumbai','Bangalore','Delhi'])

print(frame,'\n') 

print(np.abs(frame)) # as some of you may have already guessed, this will remove the '-' signs from the values within the the dataframe

                  a         b         c         d
Kolkata    0.714239 -0.650867 -1.136870  0.211169
Mumbai    -0.473777 -0.832302 -0.526599 -1.058064
Bangalore  0.232687  0.096265 -0.491450  1.045755
Delhi     -0.402157  0.304995  0.580721 -1.715713

                  a         b         c         d
Kolkata    0.714239  0.650867  1.136870  0.211169
Mumbai     0.473777  0.832302  0.526599  1.058064
Bangalore  0.232687  0.096265  0.491450  1.045755
Delhi      0.402157  0.304995  0.580721  1.715713

In [49]:
# lets make a function and then apply it on the DataFrame
def f1(x):
    return x.max() - x.min()


print(frame.apply(f1)) # per column this returns the (max - min) value
# ^
# |
# |
# |
# ^

a    1.188016
b    1.137297
c    1.717591
d    2.761469
dtype: float64

In [50]:
# Now lets say we want to apply this through the rows

print(frame.apply(f1, axis = 'columns'))
# see now this returns the row wise, which might be a bit confusing now lets visualize it 
# <------->

Kolkata      1.851109
Mumbai       0.584288
Bangalore    1.537205
Delhi        2.296434
dtype: float64

In [51]:
# We can also apply some formatting according to our needs, e.g
def my_format(x):
    return f'{x:.3f}'

print(frame.map(my_format)) # this does the thing

                a       b       c       d
Kolkata     0.714  -0.651  -1.137   0.211
Mumbai     -0.474  -0.832  -0.527  -1.058
Bangalore   0.233   0.096  -0.491   1.046
Delhi      -0.402   0.305   0.581  -1.716

### Sorting and Ranking

In [52]:
# Sorting a dataset by some crieterion is another important built-in operation. To sort lexicographically by row or column label, 
# use the sort_index method, which returns a new sorted object

# obj = pd.DataFrame(np.arange(4),index = ['a','b','c','d'],columns = ['values'])
# print(obj)

obj = pd.Series(np.arange(4), index = ['d','c','b','a'])
print(obj)

print(obj.sort_index()) # this sorts the series indexwise

d    0
c    1
b    2
a    3
dtype: int64
a    3
b    2
c    1
d    0
dtype: int64

In [53]:
# with a DataFrame, you can sort by index on either axis

frame = pd.DataFrame(np.arange(24).reshape((6,4)),index = ['four','six','one','three','two','five'],columns = ['a','d','b','c'])
print(frame)

# lets first sort the frame by column
print(frame.sort_index(axis = 'columns'))
# lets now assign this one a pointer 
column_sorted_frame = frame.sort_index(axis = 'columns') # in here if you add ascending = False

        a   d   b   c
four    0   1   2   3
six     4   5   6   7
one     8   9  10  11
three  12  13  14  15
two    16  17  18  19
five   20  21  22  23
        a   b   c   d
four    0   2   3   1
six     4   6   7   5
one     8  10  11   9
three  12  14  15  13
two    16  18  19  17
five   20  22  23  21

In [54]:
# we can also sort series by values like this in here
obj = pd.Series([6,2,9,3,1,6,10])
print(obj.sort_values()) # on the left side you can see the indexes

4     1
1     2
3     3
0     6
5     6
2     9
6    10
dtype: int64

In [55]:
# in case you want to pass some NaN values
obj = pd.Series([4,np.nan,5,np.nan,-1,-6])
print(obj.sort_values())
print("")
# now interestingly you can pu the nan values first by using this feature
print(obj.sort_values(na_position = 'first'))

5   -6.0
4   -1.0
0    4.0
2    5.0
1    NaN
3    NaN
dtype: float64

1    NaN
3    NaN
5   -6.0
4   -1.0
0    4.0
2    5.0
dtype: float64

In [56]:
new_frame = pd.DataFrame({'b':[4,2,3,1],
                          'a':[5,2,6,3]})

# lets sort this frame by values present in the two columns , one by one
print(new_frame.sort_values(['a','b'])) # first by the values in a and then keeping them in-tact,
# b rearranges itself as much as possible (don;t get the literal meaning see it for yourself first) 
# see the index position in the first non-named column, thats where you find the trick

   b  a
1  2  2
3  1  3
0  4  5
2  3  6

In [57]:
# Lets Learn about Rank method
# Ranking assings ranks from one through the number of valid data points in an array starting from the lowest value
obj = pd.Series([6,2,34,3,1,7,2,-2,-78])
print(obj.rank()) # see the last element which is -78 got rank 1.0 followed by 2.0 for -2, because that was bigger than it and rest follows

0    7.0
1    4.5
2    9.0
3    6.0
4    3.0
5    8.0
6    4.5
7    2.0
8    1.0
dtype: float64

In [58]:
# ranks can also be assigned according to the order in which they're observed in the data
# lets try that again 
print(obj.rank(method = 'first')) # the main difference you will notice
# that on the main series the values in index 1 and 6 were the same but as the first 2 was discovered earlier so it became 4.0 and the latter one became 5.0

0    7.0
1    4.0
2    9.0
3    6.0
4    3.0
5    8.0
6    5.0
7    2.0
8    1.0
dtype: float64

In [59]:
# let us try thr rank method with a dataframe now
frame = pd.DataFrame({'B':[6,2,3,1,9],'A':[8,2,5,1,4],'C':[10,3,7,2,6]})
print(frame.rank(axis = 1)) # the scanner scans through like hoeizontally < ---- >
# lets try the other ranking method
print(frame.rank(axis=1, method = 'first')) # thing is if we don;t use the first thing, the values that are the same will have same rank like 1.5 and 1.5 
# but with this the rank will change 1.0, 2.0, 3.0 like this

     B    A    C
0  1.0  2.0  3.0
1  1.5  1.5  3.0
2  1.0  2.0  3.0
3  1.5  1.5  3.0
4  3.0  1.0  2.0
     B    A    C
0  1.0  2.0  3.0
1  1.0  2.0  3.0
2  1.0  2.0  3.0
3  1.0  2.0  3.0
4  3.0  1.0  2.0

In [60]:
# lets say you have a data frame or series that has a lot of indexes and you want to find out if there are duplictes or not
non_unique_frame = pd.Series(np.arange(5),index = ['c','a','c','c','b'])
print(non_unique_frame)
non_unique_frame.index.is_unique # as usual returns false

c    0
a    1
c    2
c    3
b    4
dtype: int64

False

In [61]:
# random frame creation
frame_randiom = pd.DataFrame(np.random.randint(1,100,size = 16).reshape((4,4)),
                             index = ['Broly','Goku','Vegeta','Gohan'],
                             columns = ['STR','SPEED','DEF','END'])
print(frame_randiom)

        STR  SPEED  DEF  END
Broly    13     72   51    8
Goku     18      5   34   68
Vegeta   31     76    5   90
Gohan    17     73   49   42

### Data Loading, Storage, and File Formats

#### read_csv -->
###### Load delimited data from a file, URL, or file-like object; use comma as a default delimiter
#### read_fwf -->
###### Read data 
#### read_clipboard -->
###### variation of read_csv that reads data from the cilpboard; useful for converting tables from web pages
#### read_excel -->
###### Read tabular data from a Excel XLS or XLSX file
#### read_hdf -->
###### Read HDF5 files written by pandas 
#### read_html -->
###### Read all tabes found in the given HTML document

#### read_json -->
###### Read data from a JSON string representation, file, ULR, or file-like object
#### read_feather -->
###### Read the Feather binary format
#### read_orc -->
###### Read the Apache ORC binary file format
#### read_parquet -->
###### Read the Apache Paquet binary file format
#### read_pickle -->
###### Read an object stored by pandas using the python pickle format

#### read_sas -->
###### Read a SAS dataset stored byb pandas using the Python pickle format
#### read_spss -->
###### Read a data file created by SPSS
#### read_sql -->
###### Read the results of a SQL query(using SQLAlchemy)
#### read_sql_table -->
###### Read a whole SQL table(using SQL ALchemy); equivalent to using a query that selects everything in that table using read_sql
#### read_stata -->
###### Read a dataset from Stata file format
#### read_xml --> 
###### Read a table of data from an XML file

In [62]:
# using the pd.read_csv to use a pointer to the newly_initiated dataframe
df = pd.read_csv('C:\\Users\\GOGOL\\Downloads\\Python_Readable_csvs.csv') 
df.index.name = 'Serial No'
print(df)

                 Name  Age     Sax  Height(cm)
Serial No
0           Swapnanil   25    Male         176
1            Anshuman   27    Male         162
2              Sunavo   24    Male         163
3          Saptarsshi   25    Male         168
4               Ritom   29    Male         157
5             Syudney   32  Female         165
6              Rafael   22    Male         181
7               Sofia   25  Female         175
8            Anveeksh   29    Male         182
9              Soumik   27    Male         161
10          Debosmita   29  Female         177
11          Ritoborti   32  Female         161

In [63]:
# lets say we want to not use the headers in that case,
# ('path',header = None) this will change the headers to 0 1 2 3 4

In [64]:
# if you wish to customize the headers then use this 
df2 = pd.read_csv('C:\\Users\\GOGOL\\Downloads\\Python_Readable_csvs.csv',names = ['Nam','Boyos','Sux','Ucchata'])
df2.index.name = 'Serial No.'
print(df2) # see the magik here

                   Nam Boyos     Sux     Ucchata
Serial No.
0                 Name   Age     Sax  Height(cm)
1            Swapnanil    25    Male         176
2             Anshuman    27    Male         162
3               Sunavo    24    Male         163
4           Saptarsshi    25    Male         168
5                Ritom    29    Male         157
6              Syudney    32  Female         165
7               Rafael    22    Male         181
8                Sofia    25  Female         175
9             Anveeksh    29    Male         182
10              Soumik    27    Male         161
11           Debosmita    29  Female         177
12           Ritoborti    32  Female         161

In [65]:
# interestingly we can name the columns per our needs
column_names = ['Name', 'Age', 'Sex', 'Height']
index_names = ['Surnames','Bala','Shingh','Roy Chowdhury','Biswas','Chakrobarty','Sins','Nizte','Afreen','Mahesh Rao','Das Gupta','Roy','Chakrobarti']
df3 = pd.read_csv('C:\\Users\\GOGOL\\Downloads\\Python_Readable_csvs.csv', names = column_names)
df3.index = index_names
print(df3) # because our csv file already had a header, we got duplicate entries

                     Name  Age     Sex      Height
Surnames             Name  Age     Sax  Height(cm)
Bala            Swapnanil   25    Male         176
Shingh           Anshuman   27    Male         162
Roy Chowdhury      Sunavo   24    Male         163
Biswas         Saptarsshi   25    Male         168
Chakrobarty         Ritom   29    Male         157
Sins              Syudney   32  Female         165
Nizte              Rafael   22    Male         181
Afreen              Sofia   25  Female         175
Mahesh Rao       Anveeksh   29    Male         182
Das Gupta          Soumik   27    Male         161
Roy             Debosmita   29  Female         177
Chakrobarti     Ritoborti   32  Female         161

In [66]:
# Some times the columns and the data in them might need re-aligning for that we use this
data = pd.read_csv('C:\\Users\\GOGOL\\Downloads\\Python_Readable_csvs.csv', sep = '\\s+')
data # This returns the dataframe in a completely new way

    Name,Age,Sax,Height(cm)
0     Swapnanil,25,Male,176
1      Anshuman,27,Male,162
2        Sunavo,24,Male,163
3    Saptarsshi,25,Male,168
4         Ritom,29,Male,157
5     Syudney,32,Female,165
6        Rafael,22,Male,181
7       Sofia,25,Female,175
8      Anveeksh,29,Male,182
9        Soumik,27,Male,161
10  Debosmita,29,Female,177
11  Ritoborti,32,Female,161

In [67]:
# if you want to skip particular rows you could use this method -- > pd.read_csv('path',skiprows = [0,2,5]) like this

In [68]:
pd.isna(df) # this will return the dataframe but masking the data with the isna filter and return booleans inplace

            Name    Age    Sax  Height(cm)
Serial No
0          False  False  False       False
1          False  False  False       False
2          False  False  False       False
3          False  False  False       False
4          False  False  False       False
5          False  False  False       False
6          False  False  False       False
7          False  False  False       False
8          False  False  False       False
9          False  False  False       False
10         False  False  False       False
11         False  False  False       False

In [69]:
# I am skipping the sentibels regarding pandas, because I,myself am not sure how it functions

In [70]:
# Now I am going to write some important arguments, you may keep them in mind

# 1. path - string indicating filesystem location , URL, or file-like object.

# 2. sep or delimiter - character sequence or regualr expression to use to split fields in each row.

# 3. header - Row number to use as column names; default to 0 (first row), but should be None if there is no header row.

# 4. index_col - Column numbers or names to use as the row index in the result; can be a single name/number or a list of them for a hieraechical index.

# 5. names - list of column names for result.

# 6. skiprows - number of rows at beginning of file to ignore or list of row numbers(starting from 0) to skip.

# 7. na_values - sequence of values to replace with NA . They are added to the default list unless.

# 8. keep_default_na - Whether to use the default NA valuelist or not(True by default)

# 9. parse_dates -  attempts to parse data to datetime; False by default . if True, will attempt to parse all columns. Otherwise, can specify a list of column numbers or names to parse.
                    # if clement of list is a tuple or list, will combine multiple columns together and parse to date.   

# 10. keep_data_col - if joining columns to parse data, keep the joined columns; False by default.

# 11. converters - Dictionary containing column number or name mapping to functions (e.g{'foo':f} would apply the function f to all values 
                    # in the 'foo' column
# 12. dayfirst - when parsing potertially ambigious dates, treat as international format (e.g., 07/06/2034 June 7, 2034)

# 13. date_parser - function to use to parse dates

# 14. nrows - Number of rows to read from the beginning of file(not counting the header)

# 15. iterator - Return a TextFileReader object for reading the file piecemeal. This object can also be used with the with statement.

# 16. chunksize - For iteration, size of the file chunks

# 17. skip_footer - Number of Lines to ignore at end of file.

# 18. verbose - print various parsing information, like the time spent in each stage of the file conversion and memory use information.

# 19. encoding - text encoding (e.g., 'UTF-8','UTF-16' etc)

# 20. squeeze - if the parsed data contains only one columns, return Series

# 21. thousands - seperator for thousands (e.g., ',' or '.'), default is None.

# 22. decimal - Decimal seperators in numbers default is '.'

# 23. engine CSV parsing parsing and conversion engine to use.

##### Reading Text Files in Pieces

In [71]:
pd.options.display.max_rows = 10 # you can set it to something else, what this will do is that this will make sure next time you load and show a dataset,
# it will limit the return amount the what you set this function to e.g, in this case 10
data = pd.read_csv('C:\\Users\\GOGOL\\Downloads\\Python_Readable_csvs.csv')
print(data) # see this has returned 10 visible rows

          Name  Age     Sax  Height(cm)
0    Swapnanil   25    Male         176
1     Anshuman   27    Male         162
2       Sunavo   24    Male         163
3   Saptarsshi   25    Male         168
4        Ritom   29    Male         157
..         ...  ...     ...         ...
7        Sofia   25  Female         175
8     Anveeksh   29    Male         182
9       Soumik   27    Male         161
10   Debosmita   29  Female         177
11   Ritoborti   32  Female         161

[12 rows x 4 columns]

In [72]:
# an alternate method is this
display_n_rows = data = pd.read_csv('C:\\Users\\GOGOL\\Downloads\\Python_Readable_csvs.csv',nrows = 8)
print(display_n_rows)

         Name  Age     Sax  Height(cm)
0   Swapnanil   25    Male         176
1    Anshuman   27    Male         162
2      Sunavo   24    Male         163
3  Saptarsshi   25    Male         168
4       Ritom   29    Male         157
5     Syudney   32  Female         165
6      Rafael   22    Male         181
7       Sofia   25  Female         175

In [73]:
new = data.sort_values(by = ['Height(cm)','Age'], ascending = True)
print(new)

         Name  Age     Sax  Height(cm)
4       Ritom   29    Male         157
1    Anshuman   27    Male         162
2      Sunavo   24    Male         163
5     Syudney   32  Female         165
3  Saptarsshi   25    Male         168
7       Sofia   25  Female         175
0   Swapnanil   25    Male         176
6      Rafael   22    Male         181

### lets say you have modified a file in some way to save it with the same name or a new name use this 
data.to_csv('path') # this will end in soimething like 'C://File_1//File_2...//name.csv' example
### interestingly other delimiters can be used
import sys
data.to_csv(sys.stdout, sep ="|")
### Missing value appear as empty strings in the output. You might want to denote them by some other sentinel value
data.to_csv(sys.stdout, na_rep = 'NULL')
### Other ways
data.to_csv(sys.stdout,index = False, header = False)
data.to_csv(sys.stdout, index = False, columns = ['a','b','c'])

In [74]:
### Working with other Delimited Formats
import csv
f = open('C:\\Users\\GOGOL\\Downloads\\Python_Readable_csvs.csv') # a file like this doesn't exist 
reader = csv.reader(f)

for line in reader:
    print(line)

f.close() # always make sure to close the f when the job is done, its simply great practice

['Name', 'Age', 'Sax', 'Height(cm)']
['Swapnanil', '25', 'Male', '176']
['Anshuman', '27', 'Male', '162']
['Sunavo', '24', 'Male', '163']
['Saptarsshi', '25', 'Male', '168']
['Ritom', '29', 'Male', '157']
['Syudney', '32', 'Female', '165']
['Rafael', '22', 'Male', '181']
['Sofia', '25', 'Female', '175']
['Anveeksh', '29', 'Male', '182']
['Soumik', '27', 'Male', '161']
['Debosmita', '29', 'Female', '177']
['Ritoborti', '32', 'Female', '161']

In [75]:
# Another way of putting this same thing is
with open('C:\\Users\\GOGOL\\Downloads\\Python_Readable_csvs.csv') as G:
    lines = list(csv.reader(G))
    for items in lines:
        print(items,' \n')

G.close()

['Name', 'Age', 'Sax', 'Height(cm)']

['Swapnanil', '25', 'Male', '176']

['Anshuman', '27', 'Male', '162']

['Sunavo', '24', 'Male', '163']

['Saptarsshi', '25', 'Male', '168']

['Ritom', '29', 'Male', '157']

['Syudney', '32', 'Female', '165']

['Rafael', '22', 'Male', '181']

['Sofia', '25', 'Female', '175']

['Anveeksh', '29', 'Male', '182']

['Soumik', '27', 'Male', '161']

['Debosmita', '29', 'Female', '177']

['Ritoborti', '32', 'Female', '161']

In [76]:
class my_dialect(csv.Dialect):
    lineterminator = "\n"
    delimiter = ";"
    quotechar = '"'
    quoting = csv.QUOTE_MINIMAL

with open('C:\\Users\\GOGOL\\Downloads\\Python_Readable_csvs.csv') as G:
    reader = csv.reader(G, dialect = my_dialect)
    reader = csv.reader(G, delimiter = '|')
    print([(stuff) for stuff in reader]) # see the out put yourself quite interesting
    G.close()


# Now lets learn about some Arguments and what they basically do

[['Name,Age,Sax,Height(cm)'], ['Swapnanil,25,Male,176'], ['Anshuman,27,Male,162'], ['Sunavo,24,Male,163'], ['Saptarsshi,25,Male,168'], ['Ritom,29,Male,157'], ['Syudney,32,Female,165'], ['Rafael,22,Male,181'], ['Sofia,25,Female,175'], ['Anveeksh,29,Male,182'], ['Soumik,27,Male,161'], ['Debosmita,29,Female,177'], ['Ritoborti,32,Female,161']]

#### delimiter
One-character string to seperate fields; defaults to ","
#### lineterminator
line terminaotor for writting defaults to "\r\n". Reader ignores this and recognizes cross-platform line terminators
#### quotechar
Quote character for fields with special characters(like a delimiter); default is '"'.
#### quoting
Quoting convention. Options include csv.QUOTE_ALL, csv.QUOTE_MINIMAL(only fields with special characters like the delimiter), csv.QUOTE_NONNUMERIC, and csv.QUOTE_NONE(no quoting).See Python's documentation for full details. Defaults to  QUOTE_MINIMAL.
#### skipinitialspace
Ignore whitespace after each delimiter, default is False.
#### doublequote
How to handle quoting character inside a field; if True, it is doubled
#### escapechar
String to escape the delimiter if quote is set to csv.QUOTE_NONE; disabled by default.

### JSON Data

JSON (javascript object notation) has become one of the standard formats for sending data by HTTP request between web Browsers and Other applications. It is much more free-form data format than a tabular text form like CSV


e.g., see below

In [77]:
obj = """ 
            { "name" : "Wes",
              "cities_visited" : ['Kolkata','Delhi','Bangalore','Mumbai','Hydrabad'],
              'pet' : null,
              'siblings' : [{'name' : 'Scott', 'age' : 34, 'hobbies' : ['guitars','soccer']},
                            {'name' : 'Hailey', 'age' : 27,'hobbies' : ['UFC','Chess'] }]
            }
            """

obj = obj.replace("'",'"')
# JSON is very nearly valid Python code with the exception of its null value and some other nuances (such as disallowing trailing commas at the end of lists.)
# The nulls. All of the keys in an object must be strings. There are several Python libraries for reading and writing JSON data. We'll use json here,
# as it is built into the Python standard library.

In [78]:
# To convert a JSON string to Python form, use -- > json.loads
import json

result = json.loads(obj)

result

{'name': 'Wes',
 'cities_visited': ['Kolkata', 'Delhi', 'Bangalore', 'Mumbai', 'Hydrabad'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 34, 'hobbies': ['guitars', 'soccer']},
  {'name': 'Hailey', 'age': 27, 'hobbies': ['UFC', 'Chess']}]}

In [79]:
# json.dumps on the other hand, converts a python object back to JSON:
asjson = json.dumps(result)

print(asjson) # see the JSON output and the converted dataset look quite different

{"name": "Wes", "cities_visited": ["Kolkata", "Delhi", "Bangalore", "Mumbai", "Hydrabad"], "pet": null, "siblings": [{"name": "Scott", "age": 34, "hobbies": ["guitars", "soccer"]}, {"name": "Hailey", "age": 27, "hobbies": ["UFC", "Chess"]}]}

In [80]:
# Lets now convert parts of the JSON file into DataFrames
siblings = pd.DataFrame(result['siblings'], columns = ['name','age','hobbies'])
print(siblings) # we could have returned one, two or three columns and look at the last column, it has values within []

     name  age            hobbies
0   Scott   34  [guitars, soccer]
1  Hailey   27       [UFC, Chess]

#### I don't have a JSON file but anyways the pandas.read_json can automatically convert JSON datasets in specific arrange-ments into a Series
#### or DataFrame. For example -

In [81]:
import sys
# data = pd.read_json('C://...//something.json')

# another way of exporting data from pandas to JSON is -

# data.to_json(sys.stdout)   # it just shows the data in the JSON format it doesn't store or anything

#### XML and HTML: Web Scraping

Python has many libraries for reading and writing data in the ubiquitious HTML and XML formats.
Examples include lxml, Beautiful Soup, and html5lib. 
While lxml is comparatively much faster in general, the other libraries can be better handle malformed HTML or XML files.

Pandas has a built-in function pandas.read_html, which uses all these libraries to automatically parse tables out of HTML files as DataFrame
objects.

In [82]:
# it looks something like this pretty similar to the previous ones - 
# tables = pd.read_html("origin/something.html)

#### Parsing XML with lxml.objectify

XML is another common structured data supported hierarchical, nested data with metadata.

### from lxml import objectify

##### path = 'datasets/mta_perf/../something.xml'

with open(path) as f:
    parsed = objectify.parse(f)

##### root = parsed.getroot()

root.INDICATOE returns a generator yielding each <INDICATOR> XML element. For each record, we can populate a dictionary if tag names(like YTD_ACTUAL)
to data values(excluding a few tags) by running the following code

#### Binary Data Formats

One Simple way to store (or serialize) data in binary format is using Pythons' built-in pickle module.
pandas objects all have a to_pickle method that writes the data to disk in pickle format

In [83]:
data = pd.read_csv("C:\\Users\\GOGOL\\Documents\\My Projects\\Pandas\\International_Education_Costs.csv")
data.head(10)

,Country,City,University,Program,Level,Duration_Years,Tuition_USD,Living_Cost_Index,Rent_USD,Visa_Fee_USD,Insurance_USD,Exchange_Rate
0,USA,Cambridge,Harvard University,Computer Science,Master,2.0,55400,83.5,2200,160,1500,1.00
1,UK,London,Imperial College London,Data Science,Master,1.0,41200,75.8,1800,485,800,0.79
2,Canada,Toronto,University of Toronto,Business Analytics,Master,2.0,38500,72.5,1600,235,900,1.35
3,Australia,Melbourne,University of Melbourne,Engineering,Master,2.0,42000,71.2,1400,450,650,1.52
4,Germany,Munich,Technical University of Munich,Mechanical Engineering,Master,2.0,500,70.5,1100,75,550,0.92
5,Japan,Tokyo,University of Tokyo,Information Science,Master,2.0,8900,76.4,1300,220,750,145.80
6,Netherlands,Amsterdam,University of Amsterdam,Artificial Intelligence,Master,1.0,15800,73.2,1500,180,720,0.92
7,Singapore,Singapore,National University of Singapore,Finance,Master,1.5,35000,81.1,1900,90,800,1.34
8,France,Paris,Sorbonne University,International Relations,Master,2.0,4500,74.6,1400,99,650,0.92
9,Switzerland,Zurich,ETH Zurich,Physics,Master,2.0,1460,91.5,2100,88,1200,0.89

### Reading Microsoft Excel Files

In [84]:
# !pip install openpyxl xlrd # this will install the required package within the root directory

xlsx = pd.ExcelFile("C:\\Users\\GOGOL\\Downloads\\wtf_is_this.xlsx") # loads the file into the memory pointer being the xlsx
print(xlsx) # returns a generator object for the data inside the xlsx file
xlsx.sheet_names # this shows the sheet name

<pandas.io.excel._base.ExcelFile object at 0x000001A1F1CDF380>

['Orders']

Data Stored in a sheet can then be read into DataFrame with Parse

In [85]:
xlsx.parse(sheet_name = "Orders", nrows = 4) # this returns 4 rows from the parsed sheet

,Order ID,Order Date,Delivery Date,Customer ID,Customer Name,City,Country,Postal Code,Country Code,Cost,Sales,Quantity,Discount,Delivery Cost,Course Name,Cuisine Name,Starter Name,Desert Name,Drink,Sides
0,54-366-6861,2020-06-15,2020-03-26,72-055-7985,Laney Fadden,Daruoyan,China,993-0031,CN,125,187.5,2,20.00,60.51,Greek salad,Greek,Olives,Greek yoghurt,Athens White wine,Tapas
1,63-761-3686,2020-08-25,2020-07-17,65-353-0657,Giacopo Bramich,Ongjin,North Korea,216282,KP,235,352.5,1,15.00,96.75,Bean soup,Italian,Flatbread,Ice cream,Corfu Red Wine,Potato salad
2,65-351-6434,2021-08-17,2020-04-24,90-876-6799,Lia Bonar,Quince Mil,Peru,663246,PE,75,112.5,3,10.52,36.37,Pizza,Italian,Minestrone,Cheesecake,Italian Coffee,Bruschetta
3,36-917-2834,2021-08-14,2020-04-13,73-873-4827,Merrill Baudon,Susaki,Japan,987-0352,JP,220,330.0,3,11.23,5.49,Carbonara,Turkish,Tomato bread,Affogato,Roma Red wine,Focaccia

In [86]:
xlsx.parse(sheet_name = 'Orders', index_col = 0, nrows = 5) # removes the primary index column

,Order Date,Delivery Date,Customer ID,Customer Name,City,Country,Postal Code,Country Code,Cost,Sales,Quantity,Discount,Delivery Cost,Course Name,Cuisine Name,Starter Name,Desert Name,Drink,Sides
Order ID,,,,,,,,,,,,,,,,,,,
54-366-6861,2020-06-15,2020-03-26,72-055-7985,Laney Fadden,Daruoyan,China,993-0031,CN,125,187.5,2,20.00,60.51,Greek salad,Greek,Olives,Greek yoghurt,Athens White wine,Tapas
63-761-3686,2020-08-25,2020-07-17,65-353-0657,Giacopo Bramich,Ongjin,North Korea,216282,KP,235,352.5,1,15.00,96.75,Bean soup,Italian,Flatbread,Ice cream,Corfu Red Wine,Potato salad
65-351-6434,2021-08-17,2020-04-24,90-876-6799,Lia Bonar,Quince Mil,Peru,663246,PE,75,112.5,3,10.52,36.37,Pizza,Italian,Minestrone,Cheesecake,Italian Coffee,Bruschetta
36-917-2834,2021-08-14,2020-04-13,73-873-4827,Merrill Baudon,Susaki,Japan,987-0352,JP,220,330.0,3,11.23,5.49,Carbonara,Turkish,Tomato bread,Affogato,Roma Red wine,Focaccia
86-114-9232,2020-12-20,2021-02-02,80-927-5246,Tasia Fautly,Tobruk,Libya,351 01,LY,320,480.0,2,51.05,63.64,Kabasa,Greek,Falafel,Turkish yoghurt,Ankara White Wine,Meatballs

Now Lets Say we want to read_excel files and like in previous cases, we would like to assign a pointer to the memory where this will be stored

In [87]:
frame = pd.read_excel("C:\\Users\\GOGOL\\Downloads\\wtf_is_this.xlsx", sheet_name = 'Orders') # because this is a xlsx file, you must mention sheet name
print(frame) # returns a lots of data basically all the data
# you will notice as there are toom many columns, the output looks a bit odd, but thats alright

          Order ID Order Date Delivery Date  Customer ID  \
0      54-366-6861 2020-06-15    2020-03-26  72-055-7985
1      63-761-3686 2020-08-25    2020-07-17  65-353-0657
2      65-351-6434 2021-08-17    2020-04-24  90-876-6799
3      36-917-2834 2021-08-14    2020-04-13  73-873-4827
4      86-114-9232 2020-12-20    2021-02-02  80-927-5246
...            ...        ...           ...          ...
20995  32-698-1958 2021-11-02    2020-10-12  79-834-1150
20996  66-068-8313 2021-10-12    2021-10-20  91-484-8549
20997  02-311-4674 2022-06-30    2022-11-04  58-358-2956
20998  85-569-0097 2020-12-21    2020-10-05  40-946-4285
20999  33-294-7116 2020-11-09    2020-08-17  22-719-1060

              Customer Name                        City      Country  \
0              Laney Fadden                    Daruoyan        China
1           Giacopo Bramich                      Ongjin  North Korea
2                 Lia Bonar                  Quince Mil         Peru
3            Merrill Baudon                      Susaki        Japan
4              Tasia Fautly                      Tobruk        Libya
...                     ...                         ...          ...
20995         Paton Fritzer             Nowe Grocholice       Poland
20996       Kelbee Illesley                 Sete Lagoas       Brazil
20997  Christabella Coathup                      Bangil    Indonesia
20998         Ephrem Steers        Saint-Andr-Avellin       Canada
20999        Melesa Halahan  Fernando Gutierrez Barrios       Mexico

      Postal Code Country Code    Cost    Sales  Quantity  Discount  \
0        993-0031           CN  125.00  187.500         2     20.00
1          216282           KP  235.00  352.500         1     15.00
2          663246           PE   75.00  112.500         3     10.52
3        987-0352           JP  220.00  330.000         3     11.23
4          351 01           LY  320.00  480.000         2     51.05
...           ...          ...     ...      ...       ...       ...
20995    993-1266           PL  124.62  186.930         3      9.71
20996  1104217362           BR  144.09  216.135         2     80.34
20997  1104664326           ID  101.60  152.400         1     54.08
20998    987-1587           CA   93.13  139.695         2     98.01
20999     1586 01           MX   44.57   66.855         3     99.24

       Delivery Cost  Course Name Cuisine Name  Starter Name      Desert Name  \
0              60.51  Greek salad        Greek        Olives    Greek yoghurt
1              96.75    Bean soup      Italian     Flatbread        Ice cream
2              36.37        Pizza      Italian    Minestrone       Cheesecake
3               5.49    Carbonara      Turkish  Tomato bread         Affogato
4              63.64       Kabasa        Greek       Falafel  Turkish yoghurt
...              ...          ...          ...           ...              ...
20995          49.46      Shwarma      Turkish     Flatbread          Baklava
20996          28.02  Greek salad        Greek    Minestrone    Greek yoghurt
20997           9.48    Bean soup      Italian  Tomato bread        Ice cream
20998          43.62        Pizza      Italian       Falafel       Cheesecake
20999          55.72    Carbonara      Turkish        Hummus         Affogato

                   Drink         Sides
0      Athens White wine         Tapas
1         Corfu Red Wine  Potato salad
2         Italian Coffee    Bruschetta
3          Roma Red wine      Focaccia
4      Ankara White Wine     Meatballs
...                  ...           ...
20995     Turkish Coffee         Fries
20996  Athens White wine         Tapas
20997     Corfu Red Wine  Potato salad
20998     Italian Coffee    Bruschetta
20999      Roma Red wine      Focaccia

[21000 rows x 20 columns]

 To write pandas data to excel format, you must first create an ExcelWriter, then write data to it using the pandas object's to_excel method
 here are the following methods

#### writer = pd.ExcelWriter("C:\\Users\\GOGOL\\Downloads\\wtf_is_this.xlsx") 
 this has to be something else that we will be merging with our original xlsx file (Sheet)
#### frame.to_excel(writer, "Sheet1")
#### writer.save()

 We can also passs a file path to to_excel and avoid the ExcelWriter
#### frame.to_excel("exampls/ex2.xlsx")

#### Using HDF5 Format

HDF5 is a respected file format intended for storing large quantities of scientific array data.
It is available as a C library, and it has interfaces available in many other languages, including Java, Julia, MATLAB, and Python.

HDF = Hierarchical Data Format

In [88]:
# !pip install tables

In [89]:
new_frame = pd.DataFrame({"a": np.random.standard_normal(33)})
store = pd.HDFStore("C:\\Users\\GOGOL\\OneDrive\\Desktop\\mydata.h5")

store["obj1"] = new_frame["a"]

print(store) # this returns the class value
# if you wanted to print the HDF5 values
print(store['obj1'])
store.close()

<class 'pandas.io.pytables.HDFStore'>
File path: C:\Users\GOGOL\OneDrive\Desktop\mydata.h5

0     1.117378
1    -0.993002
2    -0.071838
3     0.657061
4     0.898668
        ...
28   -0.915563
29   -0.612758
30    0.676510
31   -0.743977
32    1.789432
Name: a, Length: 33, dtype: float64

The special thing with HDF5 type of data is that we can also use query language like this:

#### the next block of code won't work directly as I have not passed in data

In [90]:
# store.put("obj2",new_frame, format = "table")
# store.select("obj2", where=["index>= 10 and index <= 15"]) 
# # this is how you can use restrictions on the data that you'll get as your output
# store.close()

The pandas.read_hdf function gives you a shortcut to these tools:

anyways same case with this one as  well as the file path is not mentioned -- >

In [91]:
# frame.to_hdf("path", 'obj3', format = "table")
# # and to read it 
# pd.read_hdf("path",'obj3', where = ["index < 5"])

In [92]:
# if you would like to remove the HDF5 file from your OS
# do this - 
import os 
os.remove("C:\\Users\\GOGOL\\OneDrive\\Desktop\\mydata.h5") # this will most certainly remove the file (unless its open or is being used )

#### Intereacting with Web APIs

In [93]:
import requests # we need to import this module
# import pandas as pd

# Get issues from a GitHub repo
resp = requests.get("https://api.github.com/repos/pandas-dev/pandas/issues")
resp.raise_for_status()  # good practice!

# Now this will work because GitHub returns JSON
data = resp.json()

# Peek at the first item
print(data[0]['title'])  # this works

# Create DataFrame with selected fields
issues = pd.DataFrame(data, columns=['number', 'title', 'labels', 'state'])

print(issues.head()) # see it for your self

BUG: pandas.pivot_table margins, dropna and observed parameters not producing expected result
   number                                              title  \
0   61469  BUG: pandas.pivot_table margins, dropna and ob...
1   61468                             ENH: Implement PDEP-17
2   61467  ENH: Support third-party execution engines in ...
3   61466  BUG: Series.str.isdigit with pyarrow dtype doe...
4   61465  BUG: Raise ValueError on integer indexers cont...

                                              labels state
0  [{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...  open
1  [{'id': 76812, 'node_id': 'MDU6TGFiZWw3NjgxMg=...  open
2  [{'id': 697792067, 'node_id': 'MDU6TGFiZWw2OTc...  open
3  [{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...  open
4                                                 []  open

###  **Intereacting with Databases**  

We had already executed the queries, running again will cause error

In [94]:
# Already Executed no need to run again

# lets first import a few things
# import sqlite3

# statement_1 = """ CREATE TABLE IF NOT EXISTS Asiz (key int primary key,
#                                      value int );"""

# conn = sqlite3.connect("mydata.sqlite") # this is the built-in database for sq3lite
# conn.execute(statement_1)
# statement_2 = """ INSERT INTO Asiz(key,value) VALUES (1,3),
#                                                      (2,2),
#                                                      (3,1); """
# conn.execute(statement_2)
# # after this we need to commit so that the changes made are saved
# conn.commit()

#### ***This is how we do it, making connections and actually executing the queries***

In [95]:
# in python there is also a method to use MySQL function as well
# we have to import 
# import mysql.connector
# import Error as e

# try:
#     conn = mysql.connector.conmnect (
#     host = '127.0.0.1',
#     user = 'root',
#     password = 'something', # change it accordingly
#     database = 'LLDB' # change it accordingly as well
#     )

#     cursor = conn.cursor() # you could also use (buffered = True) within the parenthesis, like this
#     cursor.execute(statement_1)
#     rows = cursor.fetchall() # this fetches the data where the cursor is pointing

#     for row in rows:
#         print(row)

# except Error as e:
#     print(f'The problem that we have ran onto is {e}')

# finally:
#     cursor.close() # safely stops the cursor and stops any trailing thing
#     conn.close() # closes the connection

####    **SQLAlchemy**

The SQLALchemy project is a popular python SQL tooklit that abstracts away many of the common differences between SQL databases.
pandas has a read_sql function that enables you to read data easily from a general SQLAlchemy connection.

In [96]:
# Here is how you install SQLAlchemy with pip
# !pip install sqlalchemy

In [97]:
# import sqlalchemy as sqla

# database = sqla.create_engine("sqlite//mydata.sqlite") # this might change depending on what you had used previously for the

# pd.read_sql("SELECT * FROM Asiz", database) # for me this is glitching, try to run by  yourself at your PC

### **Data Cleaning and PreparatioN**

In [98]:
import pandas as pd
import numpy as np

**Handling Missing Data**

The way that missing data is represented in pandas objects is somewhat imperfect, but it is sufficient for most real-world use. For data with float64 dtype, pandas uses the floating-point value NaN(Not a Number) to represent missing data.

The missing data is otherwise called as ***Sentinel***

In [99]:
float_data = pd.Series([1.2,-5.3,np.nan,0])
print(float_data)

# The we have the .isna() method 
print("")
print(float_data.isna()) # this will output the masked data

0    1.2
1   -5.3
2    NaN
3    0.0
dtype: float64

0    False
1    False
2     True
3    False
dtype: bool

In [100]:
# The build in python value None is considered equivalent to the NaN value in pandas or NA in R programming language

new_series = pd.Series([1,2.4,-3.56,np.nan,None,0])
print(new_series) # See the None changed to NaN

0    1.00
1    2.40
2   -3.56
3     NaN
4     NaN
5    0.00
dtype: float64

In [101]:
# We can also alter data types within the series like this:
deta = pd.Series([1,2,3,4,None], dtype = 'float64')
print(deta) # see even though we passed ints and None values in the series, we got the dtype changed with the dtype function

0    1.0
1    2.0
2    3.0
3    4.0
4    NaN
dtype: float64

**dropna** --> Filter axis labels based on whether values for each label have missing data, with varying threshold for how much missing data to tolerate

**fillna** --> Fill in missing data with some value or using an interpolation method such as 'ffill' or 'bfill'.

**isna** --> Return Boolean values indicating which values are missing/NA

**notna** --> Negation of isna, returns True for non-NA values and false for NA values

#### **Filtering out Missing Data**

In [102]:
data = pd.Series([1,5,np.nan,None,0,np.nan,2,3])
print(data)
print("")
print(data.dropna()) # See this thing completely flushed out the not a number values

0    1.0
1    5.0
2    NaN
3    NaN
4    0.0
5    NaN
6    2.0
7    3.0
dtype: float64

0    1.0
1    5.0
4    0.0
6    2.0
7    3.0
dtype: float64

##### **The other way of doing it is**

In [103]:
data[data.notna()] # this first inspects the and masks the required rows and then another data[] --> returns the rows based on the mask

0    1.0
1    5.0
4    0.0
6    2.0
7    3.0
dtype: float64

**Let's apply similar tactics in a pandasDataFrame**

In [104]:
df = pd.DataFrame([[1,0,None],[2,3,2.1],[np.nan,3.2,None]])
print(df) # this is out (3X3 df)

     0    1    2
0  1.0  0.0  NaN
1  2.0  3.0  2.1
2  NaN  3.2  NaN

In [105]:
# Lets apply the dropna function here
print(df.dropna()) # because the second and third row contained NaN values it dropped them

     0    1    2
1  2.0  3.0  2.1

In [106]:
# Now what if we wanted to perform the same operation columnwise
print(df.dropna(axis = 1)) # See because the first and the third column had NaN values in them it dropped them (column wise)

     1
0  0.0
1  3.0
2  3.2

**Let's say you want to drop both by column as well as rows the use this**

In [107]:
print(df.dropna(axis = 0).dropna(axis=1)) # yes this is how we do the thing

     0    1    2
1  2.0  3.0  2.1

**The (how ="all") Method**

In [108]:
# Say our DataFrame is like this:
df2 = pd.DataFrame([[1,2,3],[np.nan,np.nan,3],[None,None,None],[5,7,0]])
print(df2)

# Now what we will do it that as we can see that the third row has all NaN values in each of the cells, and we want to remove that 
print(df2.dropna(how="all")) # see this will erradicate the 3rd row becuase every single value in that row was 0
# now as a result we get index 0,1 and 3

     0    1    2
0  1.0  2.0  3.0
1  NaN  NaN  3.0
2  NaN  NaN  NaN
3  5.0  7.0  0.0
     0    1    2
0  1.0  2.0  3.0
1  NaN  NaN  3.0
3  5.0  7.0  0.0

In [109]:
# lets say we want to modify a particular column wihtin the data frame and want to set all the values of that row to say NaN
df2[2] = np.nan
print(df2) # see this changed the values of 2nd indexed or 3rd column to np.nan

     0    1   2
0  1.0  2.0 NaN
1  NaN  NaN NaN
2  NaN  NaN NaN
3  5.0  7.0 NaN

**Suppose we want to keep only rows containing at most a certain number of missing observations. You can indicate this with the thresh argument**

In [110]:
df = pd.DataFrame(np.random.standard_normal((7,3)))
df.iloc[:4,1] = np.nan # for the 1st indexed column(1st) from index 0 to 3 the values have changed to NaN
df.iloc[:2,2] = np.nan # in here for the 2nd index column(2nd) from index 0 and 1 the values have changed to NaN

df

          0         1         2
0 -1.054981       NaN       NaN
1  0.764347       NaN       NaN
2  0.976446       NaN -0.941988
3  0.945798       NaN  0.217149
4  2.273452  0.245737 -0.811601
5  1.520893 -0.539340  0.134886
6  0.345088  0.600324  0.280047

In [111]:
df.dropna() # drops the rows filled with any number of NaN

          0         1         2
4  2.273452  0.245737 -0.811601
5  1.520893 -0.539340  0.134886
6  0.345088  0.600324  0.280047

In [112]:
df.dropna(thresh = 2) # if the value within a row touches the thres value then that row will be dropped

          0         1         2
2  0.976446       NaN -0.941988
3  0.945798       NaN  0.217149
4  2.273452  0.245737 -0.811601
5  1.520893 -0.539340  0.134886
6  0.345088  0.600324  0.280047

**Filling out the Missing Data**

Calling fillna with a constant replaces missing values with that value.

In [113]:
df.fillna(1.34235) # see this replaces the NaN Values with 1.34235

          0         1         2
0 -1.054981  1.342350  1.342350
1  0.764347  1.342350  1.342350
2  0.976446  1.342350 -0.941988
3  0.945798  1.342350  0.217149
4  2.273452  0.245737 -0.811601
5  1.520893 -0.539340  0.134886
6  0.345088  0.600324  0.280047

**Calling fillna with a dictionary, we can use a different fill value for each column**

In [114]:
df.fillna({1:0.5,2:0})
# what this did was basically
# 1. the NaN values on the 1st indexed column got replaced with 0.5,
# 2. similar thing happend to the 2nd indexed column but instead getting replaced with 0.5 it became 0.0

          0         1         2
0 -1.054981  0.500000  0.000000
1  0.764347  0.500000  0.000000
2  0.976446  0.500000 -0.941988
3  0.945798  0.500000  0.217149
4  2.273452  0.245737 -0.811601
5  1.520893 -0.539340  0.134886
6  0.345088  0.600324  0.280047

##### The same interpolation methods available for reindexing can be used with fillna:

In [115]:
df = pd.DataFrame(np.random.standard_normal((6,3)))
df.iloc[3:6,0] = 1.5234 # guess what happened here
df.iloc[2:,1] = np.nan # starting from index 2 till the end the values of the 1st indexed column will be replaced with np.nan
df.iloc[4:,2] = np.nan # starting from index 4 till ...

df

          0         1         2
0  0.816988 -0.435048 -0.032846
1  0.311871 -0.621186  1.914266
2  0.242042       NaN  0.910929
3  1.523400       NaN  1.183014
4  1.523400       NaN       NaN
5  1.523400       NaN       NaN

#### *The ffill method*

**DataFrame.fillna(method="ffill") is used in Pandas to fill missing values by forward filling  meaning it fills each NaN with the last known non-null value above it in the same column.**

In [116]:
df.fillna(method="ffill") # This method is older

C:\Users\GOGOL\AppData\Local\Temp\ipykernel_11876\347088102.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method="ffill") # This method is older

          0         1         2
0  0.816988 -0.435048 -0.032846
1  0.311871 -0.621186  1.914266
2  0.242042 -0.621186  0.910929
3  1.523400 -0.621186  1.183014
4  1.523400 -0.621186  1.183014
5  1.523400 -0.621186  1.183014

In [117]:
df.fillna(method = "ffill", limit = 2) # in the first indexed column this filled values for 2 cells with the value of r1c1

C:\Users\GOGOL\AppData\Local\Temp\ipykernel_11876\3967884139.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method = "ffill", limit = 2) # in the first indexed column this filled values for 2 cells with the value of r1c1

          0         1         2
0  0.816988 -0.435048 -0.032846
1  0.311871 -0.621186  1.914266
2  0.242042 -0.621186  0.910929
3  1.523400 -0.621186  1.183014
4  1.523400       NaN  1.183014
5  1.523400       NaN  1.183014

**With fillna you can do lots of other things such as simple data imputation using the median or mean statistics**

In [118]:
data = pd.Series([1,4,2,5,None,6,8,np.nan,10])
print(data.fillna(data.mean())) # this has replaced the nan values with the mean() of all the values inside the Series

0     1.000000
1     4.000000
2     2.000000
3     5.000000
4     5.142857
5     6.000000
6     8.000000
7     5.142857
8    10.000000
dtype: float64

#### **Data Transformation**

**Removing Duplicates**

In [119]:
data = pd.DataFrame({"k1":["one","two"] * 3 + ["two"],
                     "k2": [1,2,3,3,4,4,5]}) # formed a dataframe from a weird dictionary like this 

data

    k1  k2
0  one   1
1  two   2
2  one   3
3  two   3
4  one   4
5  two   4
6  two   5

In [120]:
data.duplicated() # this will return a Boolean Series indicating whether each row is a duplicate or not

0    False
1    False
2    False
3    False
4    False
5    False
6    False
dtype: bool

In [121]:
# The function dataframe.drop_duplicates() will remove any dupliucate row from the dataframe
data.drop_duplicates()
# no changes were noticed as no two rows had the same value,
# interestingly

    k1  k2
0  one   1
1  two   2
2  one   3
3  two   3
4  one   4
5  two   4
6  two   5

**DataFrame.drop_duplicates(["a","b"],keep = 'first')** 

In here the 'a' and 'b' are the name of the columns and the keep option --> 'first' or 'last' will wither keep the first or the last duplicate and erase the others

In [122]:
data["v1"] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   2   1
2  one   3   2
3  two   3   3
4  one   4   4
5  two   4   5
6  two   5   6

In [123]:
data.drop_duplicates(subset=["k1"]) 
# this removed all the records that matched the records within the k1 column, thats why we only have the first two records

    k1  k2  v1
0  one   1   0
1  two   2   1

In [124]:
# Lets try the keep = 'last' method 
data.drop_duplicates(subset = ['k1'], keep = 'last') # as expected only the last records are still remaining

    k1  k2  v1
4  one   4   4
6  two   5   6

#### **Transforming Data Using a Function or Mapping**

In [125]:
foods = ['Rice','Roti','Paratha','Mughlai','Pizza','Burger','Pulao','Fried Rice','Biryani','Donut']
prices = [np.random.randint(3,13) for i in range(10)]

a_data = pd.DataFrame({"Food": [x for x in foods],
                       "Amounts": prices})

a_data

         Food  Amounts
0        Rice        9
1        Roti        9
2     Paratha        6
3     Mughlai        9
4       Pizza        5
5      Burger        6
6       Pulao        6
7  Fried Rice       11
8     Biryani        6
9       Donut        8

In [126]:
a_data['Amounts'] = a_data['Amounts'].astype(float)

#### **Extremely Important mapping**

In [127]:
meat_to_animal = {
    "Donut":"Cow",
    "Biryani":"Goat",
    "Burger":"Chicken",
    "Pizza":"Lamb",
    "Mughlai":"Dog",
    "Fried Rice": np.nan,
    "Pulao": np.nan,
    "Roti": np.nan,
    "Paratha": np.nan,
    "Rice":np.nan
}

a_data["ralated"] = a_data["Food"].map(meat_to_animal)

a_data

         Food  Amounts  ralated
0        Rice      9.0      NaN
1        Roti      9.0      NaN
2     Paratha      6.0      NaN
3     Mughlai      9.0      Dog
4       Pizza      5.0     Lamb
5      Burger      6.0  Chicken
6       Pulao      6.0      NaN
7  Fried Rice     11.0      NaN
8     Biryani      6.0     Goat
9       Donut      8.0      Cow

In [128]:
import pandas as pd
import numpy as np

#### **Replacing Values**

In [129]:
data = pd.Series([1,2,3,7,-334])
print(data)
# in here the value -334 seems unusual, so we can replace it with NA
altered_data = data.replace(-334,np.nan)
print(altered_data) # see in here, the new altered_data series has that -334 value replaced to NA

0      1
1      2
2      3
3      7
4   -334
dtype: int64
0    1.0
1    2.0
2    3.0
3    7.0
4    NaN
dtype: float64

In [130]:
# now we can alos replace multiple values from the series like this

a_data = data.replace([-334,7],[np.nan,4])
# a_data = a_data.astype(int) # this won't work becuase we have a NA value
print(a_data) # this replaced the values

0    1.0
1    2.0
2    3.0
3    4.0
4    NaN
dtype: float64

In [131]:
# interestingly the argument passed can also be a dictionary
s = data.replace({-334:5, 7:4})
print(s) # see the changes made

0    1
1    2
2    3
3    4
4    5
dtype: int64

*The data.replace method is unique from the data.str.replace which does element-sise string substitution*

#### **Renaming Axis Indexes**

In [132]:
data = pd.DataFrame(np.arange(12).reshape((3,4)),
                    index = ['Ohio','Colorado','New York'],
                    columns = ['one','two','three','four'])

print(data)

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

##### **Like a Series, the axis indexes have a map method:**

In [133]:
def transform(x):
    return x[:4].upper()

data.index = data.index.map(transform) # see this changes the indexes to look a bit different

print(data)

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [134]:
# if you wish to create a transformed version of a dataset without modifying the original, a useful method is rename:
data.rename(index = str.title, columns = str.upper)
# this directkly returns the desired output

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [135]:
# We can chbange the names of the indexes like this:
data.rename(index = {'OHIO':'INDIANA','COLO':'MEXICO'},
            columns = {'three':'lokatora'})

# now see the changed version, like this you can't update the same pointer but you can use data = data.rename(..) or create a new pointer

         one  two  lokatora  four
INDIANA    0    1         2     3
MEXICO     4    5         6     7
NEW        8    9        10    11

#### **Discretization and Binning**

*Continious data is often discretized or otherwise seperated into "bins" for analysis.*

Suppose you have data about a group of people in a study, and you want to group them into discrete age buckets

In [136]:
ages = [2,4,6,4,7,1,8,9,12,15,14,16,23,25,28,32]

# we can divide these into bins of 1 to 10, 11 to 20, 21 to 30, 31 to 40

bins = [1,11,21,31,40]
age_categories = pd.cut(ages,bins)
age_categories # see we now have 4 categories, based on the values

[(1, 11], (1, 11], (1, 11], (1, 11], (1, 11], ..., (11, 21], (21, 31], (21, 31], (21, 31], (31, 40]]
Length: 16
Categories (4, interval[int64, right]): [(1, 11] < (11, 21] < (21, 31] < (31, 40]]

In [137]:
# Each bin is identified by a special interval value type containing the lower and upper limit of each bin:
age_categories.codes

array([ 0,  0,  0,  0,  0, -1,  0,  0,  1,  1,  1,  1,  2,  2,  2,  3],
      dtype=int8)

In [138]:
print(age_categories.categories[0]) # this is the first interval
print(age_categories.categories[1]) # this is the second interval

# notice the way they represent themselvs, its a unique way, almost like set theory

(1, 11]
(11, 21]

**Now lets say you want to find out how many values lies within a particular bin**

for that use this

In [139]:
pd.Series(age_categories).value_counts() # this get you the desired output

(1, 11]     7
(11, 21]    4
(21, 31]    3
(31, 40]    1
Name: count, dtype: int64

In [140]:
# In the string representation of an interval, a parenthesis means that the side is open(exclusive), while the square bracket means it is closed
# (inclusive). You can change which side is closed by passing right = False

In [141]:
pd.cut(ages, bins, right = False) # this time on the right side

[[1, 11), [1, 11), [1, 11), [1, 11), [1, 11), ..., [11, 21), [21, 31), [21, 31), [21, 31), [31, 40)]
Length: 16
Categories (4, interval[int64, left]): [[1, 11) < [11, 21) < [21, 31) < [31, 40)]

*Now interestingly we can override the default interval-based bin labeling by passing a list of array*

In [142]:
# Like this: 
group_names = ['Kid','Teen','Adult','Old Hag']
pd.cut(ages, bins, labels = group_names)

['Kid', 'Kid', 'Kid', 'Kid', 'Kid', ..., 'Teen', 'Adult', 'Adult', 'Adult', 'Old Hag']
Length: 16
Categories (4, object): ['Kid' < 'Teen' < 'Adult' < 'Old Hag']

In [143]:
# if you pass an integer number of bins to pandas.cut instead of explicit bin edges, it will compute equal-length bins based on the minimum
# and maximum values in the data. Consider the case of some uniformly distributed data chopped into fourths.

data = np.random.uniform(size = 40)
pd.cut(data, 5, precision = 4)

[(0.6284, 0.8094], (0.2664, 0.4474], (0.0845, 0.2664], (0.8094, 0.9904], (0.8094, 0.9904], ..., (0.4474, 0.6284], (0.6284, 0.8094], (0.4474, 0.6284], (0.0845, 0.2664], (0.8094, 0.9904]]
Length: 40
Categories (5, interval[float64, right]): [(0.0845, 0.2664] < (0.2664, 0.4474] < (0.4474, 0.6284] < (0.6284, 0.8094] < (0.8094, 0.9904]]

In [144]:
power_levels = ['Low','Mid','High','Extreme','Divine']

data_n = np.random.uniform(size = 40)
binned = pd.cut(data, bins = 5, labels = power_levels)

# print(binned)

In [145]:
pd.Series(binned).value_counts()

Divine     10
Low         9
High        9
Mid         6
Extreme     6
Name: count, dtype: int64

#### **Detecting and Filtering Outliers**

Filtering or transforming outliers is largly a matter applying array operations. 
Consider a DataFrame with some normally distributed data:

In [146]:
data = pd.DataFrame(np.random.standard_normal((1000,4)))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.014954     0.001238     0.032433    -0.051363
std       0.973618     0.977115     0.978530     1.005709
min      -3.176963    -2.935723    -2.866198    -3.169061
25%      -0.626921    -0.672556    -0.632429    -0.773358
50%      -0.010758     0.000610     0.021175    -0.028658
75%       0.649446     0.704499     0.697163     0.636409
max       3.272648     3.636410     3.531057     3.288254

In [147]:
# Suppose you anted to find values in one of the columns exceeding 3 in absolute value:
col = data[2]
col

col[col.abs() > 3]

5     3.531057
31    3.058319
Name: 2, dtype: float64

In [148]:
# to select all rows having a value exceeding 3 or -3, you can use the any method on a Boolean DataFrame
data[(data.abs()> 3).any(axis = "columns")]

            0         1         2         3
5    2.497503  0.199730  3.531057 -0.604662
31  -0.802150  1.124830  3.058319  1.390477
36  -0.606584  3.365242 -0.324746  1.876810
163  3.272648  1.201230  0.585889 -0.531406
166 -0.862286  3.636410  0.565906  0.817792
775 -0.346793  0.376907 -0.418282  3.288254
978 -3.176963 -1.212071  0.505038  0.624510
990 -1.214528 -0.620153  1.484378 -3.169061

In [149]:
# to select all columns having a value exceeding 3 or -3, you can use the any method on a Boolean DataFrame
# data[(data.abs()>2).any(axis =0)] # can not do this because we have used a dataframe

In [150]:
mask = data.abs() > 1
data[mask] = np.sign(data[mask]) * 6

print(data[data.abs() > 4])

       0    1    2    3
0    NaN  NaN -6.0  NaN
1    NaN  NaN  NaN  6.0
2    NaN  NaN  NaN -6.0
3    NaN  NaN  NaN  NaN
4    NaN -6.0  NaN  NaN
..   ...  ...  ...  ...
995  NaN  NaN -6.0 -6.0
996  6.0 -6.0  NaN  NaN
997  NaN  NaN -6.0  NaN
998  NaN  6.0  NaN  6.0
999 -6.0  NaN  NaN  NaN

[1000 rows x 4 columns]

#### **Permutation and Random Sampling**

Permuting a Series or the rows in a DataFrame is possible using the numpy.random.permutation function. Calling permutation with the length of the axis you want to permute produces an array of integers indicating the new ordering.

In [151]:
import pandas as pd
import numpy as np
df = pd.DataFrame(np.arange(5*7).reshape((5,7)))
df

    0   1   2   3   4   5   6
0   0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20
3  21  22  23  24  25  26  27
4  28  29  30  31  32  33  34

In [152]:
sampler = np.random.permutation(5)
print(sampler) # this will give us a pandas Series having 5 elements in it

[3 0 1 2 4]

In [153]:
# The array can then be used in iloc-based indexing or the equivalent take function
df.take(sampler) # interesting out-put [see that the Series that we got as the index of this new DataFrame that we got as our output]

    0   1   2   3   4   5   6
3  21  22  23  24  25  26  27
0   0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20
4  28  29  30  31  32  33  34

In [154]:
# lets see that iloc 
df.iloc[sampler] # interestingly you will notice the 0th and the 3rd index have 
# their corresponding values intact but the positions are now different

    0   1   2   3   4   5   6
3  21  22  23  24  25  26  27
0   0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20
4  28  29  30  31  32  33  34

In [155]:
# by invoking take with axis = 'columns', we could also select a permutation of the columns
columns_sampler = np.random.permutation(7)
columns_sampler

array([4, 6, 2, 1, 0, 5, 3], dtype=int32)

In [156]:
df.take(columns_sampler, axis = 'columns')
# this one is extremely important, 
# see that the columns have been under the influence of permutation, the index seem intact but now, notice the first column has like 1,8,15 .. 
# the kind of way you'd have already fugired out

    4   6   2   1   0   5   3
0   4   6   2   1   0   5   3
1  11  13   9   8   7  12  10
2  18  20  16  15  14  19  17
3  25  27  23  22  21  26  24
4  32  34  30  29  28  33  31

##### *To select a random subset without replacement (the same row cannot appear twice), you can use the sample method on Series and DataFrame*

In [157]:
df.sample(n=3) # this takes a sample from the main DataFrame which was under the influence of permutation and returns a

    0   1   2   3   4   5   6
3  21  22  23  24  25  26  27
2  14  15  16  17  18  19  20
0   0   1   2   3   4   5   6

In [158]:
# to generate a sample with replacement, pass replace = True
choices = pd.Series([2,5,3,-7,1,-8])
choices.sample(n = 12, replace = True)

4    1
2    3
3   -7
4    1
3   -7
    ..
5   -8
1    5
5   -8
5   -8
3   -7
Length: 12, dtype: int64

#### **Computing Indicator/Dummy Variables**

In [159]:
df = pd.DataFrame({"key": ['a','a','b','a','c','c','b','b'],
                  "data1": range(8)})
df

  key  data1
0   a      0
1   a      1
2   b      2
3   a      3
4   c      4
5   c      5
6   b      6
7   b      7

##### what the dummy will do it that as the computer can't understand the difference between a/b/c directly,
##### the dummy transforms it so that the computer is able to grasp it

In [160]:
dummies = pd.get_dummies(df['key'],prefix = 'key') # this adds key_ before a or b or c column
# while flushing out values from the key column and making columns in this case 3
df_with_dummy = df[["data1"]].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0   True  False  False
1      1   True  False  False
2      2  False   True  False
3      3   True  False  False
4      4  False  False   True
5      5  False  False   True
6      6  False   True  False
7      7  False   True  False

In [161]:
the_file = pd.read_csv("C:\\Users\\GOGOL\\OneDrive\\Desktop\\Games.csv")
the_file.head(15)

,Console,GameName,Review,Score
0,PC,Baldur's Gate 3 Early Access Review,Early Access,6
1,NS,Control: Ultimate Edition Cloud Version Review,Good,7
2,"XONE, PC, PS4",Doom Eternal: The Ancient Gods Part 1 Review,Good,7
3,"XONE, PC, PS4",Watch Dogs: Legion Review,Great,8
4,PC,Ring Of Pain Review,Great,8
...,...,...,...,...
10,PC,Amnesia: Rebirth Review,Great,8
11,"PC, PS4",Genshin Impact Review Direct Hit,Good,7
12,"PC, XONE, PS4, NS",Ikenfell Review,Fair,6
13,NS,Ring Fit Adventure Review: One Year Later,Superb,9
14,"XONE, PC, PS4",Star Wars: Squadrons Review Catch Me If You Can,Good,7

In [162]:
# now that we have a good understanding of how there are categorical datas in row 1,2 and 3
# its perfect for use to use the dummies to get a clear idea of how it would look like

In [163]:
# but because there are too many categorical data, let me cut off only the Review and the Score column from the dataset
mod_file = the_file[['GameName','Review','Score']]
mod_file.tail(3)

                    GameName  Review  Score
14798        Endorfun Review    Good      7
14799  FIFA Soccer 96 Review  Superb      9
14800   Full Throttle Review   Great      8

In [164]:
dummies = mod_file['Review'].str.get_dummies()
dummies # this returns the result in a dummies format containing 1's and 0's

,Abysmal,Bad,Early Access,Essential,Fair,Good,Great,Mediocre,Poor,Superb,Terrible
0,0,0,1,0,0,0,0,0,0,0,0
1,0,0,0,0,0,1,0,0,0,0,0
2,0,0,0,0,0,1,0,0,0,0,0
3,0,0,0,0,0,0,1,0,0,0,0
4,0,0,0,0,0,0,1,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...
14796,0,0,0,0,0,0,1,0,0,0,0
14797,0,0,0,0,0,0,0,1,0,0,0
14798,0,0,0,0,0,1,0,0,0,0,0
14799,0,0,0,0,0,0,0,0,0,1,0
14800,0,0,0,0,0,0,1,0,0,0,0

In [165]:
# now its time for use to merge this file with the real data
# lets try merging this with Gamename

desired_result = mod_file[['GameName']].join(dummies.add_suffix('_Rating'))
desired_result.head(4)

,GameName,Abysmal_Rating,Bad_Rating,Early Access_Rating,Essential_Rating,Fair_Rating,Good_Rating,Great_Rating,Mediocre_Rating,Poor_Rating,Superb_Rating,Terrible_Rating
0,Baldur's Gate 3 Early Access Review,0,0,1,0,0,0,0,0,0,0,0
1,Control: Ultimate Edition Cloud Version Review,0,0,0,0,0,1,0,0,0,0,0
2,Doom Eternal: The Ancient Gods Part 1 Review,0,0,0,0,0,1,0,0,0,0,0
3,Watch Dogs: Legion Review,0,0,0,0,0,0,1,0,0,0,0

##### ***Now this rating is not excactly like from low to high se wea can create our custom arranged list of categorization***

In [166]:
rating_order = ['Abysmal_Rating','Terrible_Rating','Bad_Rating','Poor_Rating','Essential_Rating','Early Access_Rating','Fair_Rating','Mediocre_Rating','Good_Rating','Great_Rating','Superb_Rating']
desired_results = desired_result[rating_order]
desired_results.head(6)

,Abysmal_Rating,Terrible_Rating,Bad_Rating,Poor_Rating,Essential_Rating,Early Access_Rating,Fair_Rating,Mediocre_Rating,Good_Rating,Great_Rating,Superb_Rating
0,0,0,0,0,0,1,0,0,0,0,0
1,0,0,0,0,0,0,0,0,1,0,0
2,0,0,0,0,0,0,0,0,1,0,0
3,0,0,0,0,0,0,0,0,0,1,0
4,0,0,0,0,0,0,0,0,0,1,0
5,0,0,0,0,0,0,0,0,0,1,0

### **This was the real gamechanger here** take a great look

In [171]:
final_col = ['GameName'] + rating_order # remapping the original 'GameName' column with our own custom ordered values
desired_results = desired_result[final_col] # here we are making the modification with the placements of the binary values while
# keeping out targetef column in the forst place
desired_results.head(7)

,GameName,Abysmal_Rating,Terrible_Rating,Bad_Rating,Poor_Rating,Essential_Rating,Early Access_Rating,Fair_Rating,Mediocre_Rating,Good_Rating,Great_Rating,Superb_Rating
0,Baldur's Gate 3 Early Access Review,0,0,0,0,0,1,0,0,0,0,0
1,Control: Ultimate Edition Cloud Version Review,0,0,0,0,0,0,0,0,1,0,0
2,Doom Eternal: The Ancient Gods Part 1 Review,0,0,0,0,0,0,0,0,1,0,0
3,Watch Dogs: Legion Review,0,0,0,0,0,0,0,0,0,1,0
4,Ring Of Pain Review,0,0,0,0,0,0,0,0,0,1,0
5,Pikmin 3 Deluxe Review,0,0,0,0,0,0,0,0,0,1,0
6,Ghostrunner Review,0,0,0,0,0,0,0,0,1,0,0

In [ ]:
### A quick tip in case the column where you want to apply the dumnmies function, there seems to be a writting convention difference say for example
### the table has values like - Action,Drama,Thriller
#### in the str.pd.get_dummies("mention one symbol you want to remove here") -> "." / '?', '\' etc and so on

# Here This is even a better alternative

# import pandas as pd

# # Example DataFrame
# df = pd.DataFrame({'Genres': ['Action/\\,Drama[/,Thriller']})

# # Clean unwanted symbols: / \ [ , ]
# df['Genres_clean'] = df['Genres'].str.replace(r'[\/\\\[\],]', '', regex=True)

In [174]:
# Lets talk a bit about randomization,
# if you want your random values to to be repeatable again use this
np.random.seed(12345) # the use of seed makes sure that next time if you use 12345 as a seed you will get the same randomization

values = np.random.uniform(size = 12)
values # this out puts an array of randoms, notice no matter how many time you run this, the values won't change

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987,
       0.74771481, 0.96130674])

In [175]:
# Now lets do some bins as well, 
bins = [0.0,0.2,0.4,0.6,0.8,1.0]
pd.get_dummies(pd.cut(values, bins)) # running this will return a DataFrame with the bins woking in place

    (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0        False       False       False       False        True
1        False        True       False       False       False
2         True       False       False       False       False
3        False        True       False       False       False
4        False       False        True       False       False
..         ...         ...         ...         ...         ...
7        False       False       False        True       False
8        False       False       False        True       False
9        False       False       False        True       False
10       False       False       False        True       False
11       False       False       False       False        True

[12 rows x 5 columns]

In [178]:
# Lets try getting binary instead of getting booleans
binned = pd.cut(values,bins)
dummies = pd.get_dummies(binned).astype(int) # as they were boolans, just a simple astype did the trick
dummies

    (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0            0           0           0           0           1
1            0           1           0           0           0
2            1           0           0           0           0
3            0           1           0           0           0
4            0           0           1           0           0
..         ...         ...         ...         ...         ...
7            0           0           0           1           0
8            0           0           0           1           0
9            0           0           0           1           0
10           0           0           0           1           0
11           0           0           0           0           1

[12 rows x 5 columns]

#### **Extension Data Types**

Pandas was originally built upon the capabilities present in Numpy. 
Many Pandas concepts, such as missing data, were implemented using what was available in NumPy while trying to maximize compatibility between libraries that used Numpy and Pandas.

In [182]:
s = pd.Series([1,2,3,None])
# print(s.astype(int)) # it won't work because None does not fall under any specific data types
# print(s.asptyp(float)) # it won't work because None does not fall under any specific data types

# Now there is a way we could get some out-put in some sort of desired way
v = pd.Series([1.0,2,3.0,4,np.nan], dtype = pd.Int64Dtype())
v # this will convert the non-ints to int and return a proper series even if there is a None value, make sure that the float is changable like 
# eg. 1.0 will work but 1.1 will throw an error

0       1
1       2
2       3
3       4
4    <NA>
dtype: Int64

In [185]:
# check the dype of both s and v
print(s.dtype," ",v.dtype) # there se the difference?
# say we want some string stuff, this is the way to do it
s = pd.Series(['One','Two',None,'Three',np.nan], dtype = pd.StringDtype())
print(s) # when you do this, in the output the representation of NA is quite different which you might have noticed earlier

float64   Int64
0      One
1      Two
2     <NA>
3    Three
4     <NA>
dtype: string

In [186]:
# Interestingly you can alter dtypes after you have created your DataFrame, here is how you could do it

df = pd.DataFrame({'A':[1,2,np.nan,3],
                   'B':['one','four','three',None],
                   'C':[False, False, None, np.nan]})
df

     A      B      C
0  1.0    one  False
1  2.0   four  False
2  NaN  three   None
3  3.0   None    NaN

##### ***Follow Along***

In [187]:
df['A'] = df['A'].astype('Int64') # changes all the types to int
df['B'] = df['B'].astype('string') # changes all the types to str
df['C'] = df['C'].astype('boolean') # changes all the types to Boolean

In [188]:
df # interestingly we didn't have to use the whole dtype = pd.StringDtype() ---> this thing the astype did the shadow work swiftly

      A      B      C
0     1    one  False
1     2   four  False
2  <NA>  three   <NA>
3     3   <NA>   <NA>

####  *String Maniupulation*

In [189]:
# some python built-in String object Methods
val = "a,b,  guidolo"
val.split(",") # acted more like a csv thing

['a', 'b', '  guidolo']

In [190]:
#split is often combined with strip to trim whitespace(including breaks):
pieces = [s.strip() for s in val.split(',')]
pieces # what this does is that because we needed that extra space to go away this s.strip(removes any leading or trailing spaces)

['a', 'b', 'guidolo']

In [191]:
# lets say you want to jointhe pieces with a specific symbol, here's how you'd do it
'%'.join(pieces)

'a%b%guidolo'

In [193]:
# you could also search for a substr wihtin a str,
'guidolo' in pieces # returns True

True

In [195]:
# if you want to find the index of a string, here is how you'd do it
a_str = 'Calloc'
a_str.find('o')
# returns the 4th index

4

In [198]:
# Replace will substitute occurences of one pattern for another. It is commonly used to delete patterns, too, by passing an empty string:
val.replace(",","::")

'a::b::  guidolo'

###  Important Python String Methods

####  Searching & Counting
- `count(sub)`  Counts non-overlapping occurrences of `sub`
- `find(sub)`  Returns Index of first `sub`; `-1` if not found
- `rfind(sub)`  Returns Index of last `sub`; `-1` if not found
- `index(sub)`  Like `find()`, but raises `ValueError` if not found

####  Start/End Checks
- `startswith(prefix)`  `True` if string starts with `prefix`
- `endswith(suffix)`  `True` if string ends with `suffix`

####  Trimming
- `strip()`  Removes leading & trailing whitespace
- `lstrip()`  Removes leading whitespace
- `rstrip()`  Removes trailing whitespace

####  Case Conversion
- `lower()`  Converts to lowercase
- `upper()`  Converts to uppercase
- `casefold()`  Aggressive lowercase (for comparisons)

####  Replace & Split
- `replace(old, new)`  Replace `old` with `new`
- `split(delim)`  Splits string into list by `delim`

####  Joining
- `join(iterable)`  Joins elements using the string as a delimiter

####  Justifying
- `ljust(width, fill=' ')`  Left justify with padding
- `rjust(width, fill=' ')`  Right justify with padding

#### ***Regular Expressions***

Regular Expressions provide a flexible way to search or match(often more complex) string patterns in text. A Single expression , commonly called regex, is a string formed according to the regular expression language. Python's built-in re module is responsible for applying regular expressionss to strings.

**Re-Module**

1. Pattern matching
2. Substitution
3. Splitting

In [5]:
# Lets see some examples
import re # imports the regex module from our python library

text = "foo    bar\t  baz \tqux"
seka = re.split(r"\s+",text)
# this has taken care of the extra spaces and unwanted symbols, now let use join them
print(" ".join(seka)) # boom here it is

foo bar baz qux